; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph0 - mode
	infrared3 - mode
	image5 - mode
	infrared1 - mode
	image2 - mode
	image4 - mode
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 image5)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 image2)
	(supports instrument3 image4)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument4 image2)
	(supports instrument4 image5)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(supports instrument5 image4)
	(supports instrument5 image5)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument6 image5)
	(supports instrument6 image4)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 image4)
	(supports instrument7 image2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
	(supports instrument8 infrared1)
	(supports instrument8 image4)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
)
(:goal (and
	(pointing satellite0 Planet11)
	(pointing satellite2 Star2)
	(pointing satellite3 Star12)
	(pointing satellite4 GroundStation5)
	(have_image Phenomenon6 infrared3)
	(have_image Planet7 thermograph0)
	(have_image Planet7 image2)
	(have_image Planet8 thermograph0)
	(have_image Planet8 image2)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon9 image4)
	(have_image Star10 image2)
	(have_image Planet11 image5)
	(have_image Planet11 image2)
	(have_image Star12 image4)
))

)

; plan
1. (turn_to satellite4 groundstation5 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 groundstation5)
   goals met: 1 of 15
2. (turn_to satellite3 groundstation0 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation0)
   goals met: 1 of 15
3. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 1 of 15
4. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 1 of 15
5. (turn_to satellite3 planet8 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet8)
   goals met: 1 of 15
6. (take_image satellite3 planet8 instrument7 image2)
   added: (have_image planet8 image2)
   goals met: 2 of 15
7. (turn_to satellite3 planet7 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet7)
   goals met: 2 of 15
8. (take_image satellite3 planet7 instrument7 image2)
   added: (have_image planet7 image2)
   goals met: 3 of 15
9. (turn_to satellite3 phenomenon9 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 phenomenon9)
   goals met: 3 of 15
10. (take_image satellite3 phenomenon9 instrument7 image4)
   added: (have_image phenomenon9 image4)
   goals met: 4 of 15
11. (turn_to satellite3 phenomenon6 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon6)
   goals met: 4 of 15
12. (turn_to satellite2 star2 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star2)
   goals met: 5 of 15
13. (take_image satellite3 phenomenon6 instrument7 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 6 of 15
14. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 6 of 15
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 15
16. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 6 of 15
17. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 6 of 15
18. (turn_to satellite0 phenomenon9 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon9)
   goals met: 6 of 15
19. (take_image satellite0 phenomenon9 instrument0 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 7 of 15
20. (turn_to satellite0 planet7 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet7)
   goals met: 7 of 15
21. (take_image satellite0 planet7 instrument0 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 8 of 15
22. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 8 of 15
23. (take_image satellite0 planet8 instrument0 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 9 of 15
24. (turn_to satellite0 planet11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet11)
   goals met: 10 of 15
25. (turn_to satellite2 planet11 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet11)
   goals met: 9 of 15
26. (take_image satellite2 planet11 instrument4 image2)
   added: (have_image planet11 image2)
   goals met: 10 of 15
27. (take_image satellite2 planet11 instrument4 image5)
   added: (have_image planet11 image5)
   goals met: 11 of 15
28. (turn_to satellite2 star10 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star10)
   goals met: 11 of 15
29. (take_image satellite2 star10 instrument4 image2)
   added: (have_image star10 image2)
   goals met: 12 of 15
30. (turn_to satellite2 star2 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star2)
   goals met: 13 of 15
31. (turn_to satellite3 star12 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star12)
   goals met: 14 of 15
32. (take_image satellite3 star12 instrument7 image4)
   added: (have_image star12 image4)
   goals met: 15 of 15
